export const TWELVE_STAGE_TABLE: Record<string, string[]> = {
  갑: ["목욕","관대","건록","제왕","쇠","병","사","묘","절","태","양","장생"],
  을: ["병","쇠","제왕","건록","관대","목욕","장생","양","태","절","묘","사"],
  병: ["태","양","장생","목욕","관대","건록","제왕","쇠","병","사","묘","절"],
  정: ["절","묘","사","병","쇠","제왕","건록","관대","목욕","장생","양","태"],
  무: ["태","양","장생","목욕","관대","건록","제왕","쇠","병","사","묘","절"],
  기: ["절","묘","사","병","쇠","제왕","건록","관대","목욕","장생","양","태"],
  경: ["사","묘","절","태","양","장생","목욕","관대","건록","제왕","쇠","병"],
  신: ["장생","양","태","절","묘","사","병","쇠","제왕","건록","관대","목욕"],
  임: ["제왕","쇠","병","사","묘","절","태","양","장생","목욕","관대","건록"],
  계: ["건록","관대","목욕","장생","양","태","절","묘","사","병","쇠","제왕"]
};